reedy/ESP32-RevK/settings_lib.c
// (new) settings library
#include "revk.h"
#include "esp8266_nvs_compat.h"
#ifndef  CONFIG_REVK_OLD_SETTINGS
static const char __attribute__((unused)) * TAG = "Settings";

extern revk_settings_t revk_settings[];
extern uint32_t revk_nvs_time;

static nvs_handle nvs[2] = { -1, -1 };

static revk_setting_bits_t nvs_found = { 0 };

char *__malloc_like __result_use_check
strdup (const char *s)
{
   int l = strlen (s);
   char *o = mallocspi (l + 1);
   if (!o)
      return NULL;
   memcpy (o, s, l + 1);
   return o;
}

char *__malloc_like __result_use_check
strndup (const char *s, size_t l)
{
   int l2 = strlen (s);
   if (l2 < l)
      l = l2;
   char *o = mallocspi (l + 1);
   if (!o)
      return NULL;
   memcpy (o, s, l);
   o[l] = 0;
   return o;
}

static const char *
nvs_erase (revk_settings_t * s, const char *tag)
{
   nvs_found[(s - revk_settings) / 8] &= ~(1 << ((s - revk_settings) & 7));
   esp_err_t e = nvs_erase_key (nvs[s->revk], tag);
   if (e && e != ESP_ERR_NVS_NOT_FOUND)
      return "Failed to erase";
   if (!e)
   {
      revk_nvs_time = uptime () + 60;
#ifdef  CONFIG_REVK_SETTINGS_DEBUG
      char taga[20];
      {
         int l = strlen (tag);
         if (tag[l - 1] & 0x80)
            sprintf (taga, "%.*s[%d]", l - 1, tag, tag[l - 1] - 0x80);
         else
            strcpy (taga, tag);
      }
      ESP_LOGE (TAG, "Erase %s", taga);
#endif
   }
   return NULL;
}

static const char *
nvs_put (revk_settings_t * s, int index, void *ptr)
{                               // Put data, can be from ptr or from settings
   if (s->array && index >= s->array)
      return "Array overflow";
   char tag[16];
   if (s->len + 1 + (s->array ? 1 : 0) > sizeof (tag))
      return "Tag too long";
#ifdef  CONFIG_REVK_SETTINGS_DEBUG
   char taga[20];
   if (s->array)
      sprintf (taga, "%s[%d]", s->name, index);
   else
      strcpy (taga, s->name);
#endif
   strcpy (tag, s->name);
   if (s->array)
   {
      tag[s->len] = 0x80 + index;
      tag[s->len + 1] = 0;
   }
   // Deference
   if (ptr)
   {                            // Copy
      if (s->malloc)
         ptr = *(void **) ptr;
   } else if (!ptr && s->ptr)
   {                            // Live (not relevant for bit as no s->ptr)
      if (s->malloc)
         ptr = ((void **) s->ptr)[index];
      else
         ptr = s->ptr + index * s->size;
   }
   revk_nvs_time = uptime () + 60;
   nvs_found[(s - revk_settings) / 8] |= (1 << ((s - revk_settings) & 7));
   switch (s->type)
   {
#ifdef	REVK_SETTINGS_HAS_SIGNED
   case REVK_SETTINGS_SIGNED:
      {
         int64_t __attribute__((unused)) v = 0;
         if ((s->size == 8 && nvs_set_i64 (nvs[s->revk], tag, v = *((int64_t *) ptr))) ||       //
             (s->size == 4 && nvs_set_i32 (nvs[s->revk], tag, v = *((int32_t *) ptr))) ||       //
             (s->size == 2 && nvs_set_i16 (nvs[s->revk], tag, v = *((int16_t *) ptr))) ||       //
             (s->size == 1 && nvs_set_i8 (nvs[s->revk], tag, v = *((int8_t *) ptr))))
            return "Cannot store number (signed)";
#ifdef  CONFIG_REVK_SETTINGS_DEBUG
         ESP_LOGE (TAG, "Write %s signed %lld 0x%0*llX", taga, v, s->size * 2, v);
#endif
      }
      break;
#endif
#ifdef	REVK_SETTINGS_HAS_UNSIGNED
   case REVK_SETTINGS_UNSIGNED:
      {
         uint64_t __attribute__((unused)) v = 0;
         if ((s->size == 8 && nvs_set_u64 (nvs[s->revk], tag, v = *((uint64_t *) ptr))) ||      //
             (s->size == 4 && nvs_set_u32 (nvs[s->revk], tag, v = *((uint32_t *) ptr))) ||      //
             (s->size == 2 && nvs_set_u16 (nvs[s->revk], tag, v = *((uint16_t *) ptr))) ||      //
             (s->size == 1 && nvs_set_u8 (nvs[s->revk], tag, v = *((uint8_t *) ptr))))
            return "Cannot store number (unsigned)";
#ifdef	CONFIG_REVK_SETTINGS_DEBUG
         ESP_LOGE (TAG, "Write %s unsigned %llu 0x%0*llX", taga, v, s->size * 2, v);
#endif
      }
      break;
#endif
#ifdef	REVK_SETTINGS_HAS_BIT
   case REVK_SETTINGS_BIT:
      {
         uint8_t bit = 0;
         if (ptr)
            bit = *((uint8_t *) ptr);
         else
            bit = ((((uint8_t *) & revk_settings_bits)[s->bit / 8] & (1 << (s->bit & 7))) ? 1 : 0);
         if (nvs_set_u8 (nvs[s->revk], tag, bit))
            return "Cannot store bit";
#ifdef  CONFIG_REVK_SETTINGS_DEBUG
         ESP_LOGE (TAG, "Write %s bit %d", taga, bit);
#endif
      }
      break;
#endif
#ifdef	REVK_SETTINGS_HAS_BLOB
   case REVK_SETTINGS_BLOB:
      {
         revk_settings_blob_t *b = ptr;
         if (nvs_set_blob (nvs[s->revk], tag, b->data, b->len))
            return "Cannot store blob";
#ifdef  CONFIG_REVK_SETTINGS_DEBUG
         ESP_LOGE (TAG, "Write %s fixed %d", taga, b->len);
         ESP_LOG_BUFFER_HEX_LEVEL (TAG, b->data, b->len, ESP_LOG_ERROR);
#endif
      }
      break;
#endif
#ifdef	REVK_SETTINGS_HAS_STRING
   case REVK_SETTINGS_STRING:
      {
         if (nvs_set_str (nvs[s->revk], tag, ptr))
            return "Cannot store string";
#ifdef  CONFIG_REVK_SETTINGS_DEBUG
         ESP_LOGE (TAG, "Write %s string %s", taga, (char *) ptr);
#endif
      }
      break;
#endif
#ifdef	REVK_SETTINGS_HAS_OCTET
   case REVK_SETTINGS_OCTET:
      {
         if (nvs_set_blob (nvs[s->revk], tag, ptr, s->size))
            return "Cannot store octets";
#ifdef  CONFIG_REVK_SETTINGS_DEBUG
         ESP_LOGE (TAG, "Write %s fixed %d", taga, s->size);
         ESP_LOG_BUFFER_HEX_LEVEL (TAG, ptr, s->array, ESP_LOG_ERROR);
#endif
      }
      break;
#endif
   }
   return NULL;
}

static const char *
nvs_get (revk_settings_t * s, const char *tag, int index)
{                               // Getting NVS
   if (s->array && index >= s->array)
      return "Array overflow";
#ifdef	CONFIG_REVK_SETTINGS_DEBUG
   char taga[20];
   {
      int l = strlen (tag);
      if (tag[l - 1] & 0x80)
         sprintf (taga, "%.*s[%d]", l - 1, tag, tag[l - 1] - 0x80);
      else
         strcpy (taga, tag);
   }
#endif
   void *data = NULL;
   size_t len = 0;
   const char *store (void)
   {
      switch (s->type)
      {
#ifdef  REVK_SETTINGS_HAS_SIGNED
      case REVK_SETTINGS_SIGNED:
         {
            data = mallocspi (len = s->size);
            if (!data)
               return "malloc";
            if ((s->size == 8 && nvs_get_i64 (nvs[s->revk], tag, data)) ||      //
                (s->size == 4 && nvs_get_i32 (nvs[s->revk], tag, data)) ||      //
                (s->size == 2 && nvs_get_i16 (nvs[s->revk], tag, data)) ||      //
                (s->size == 1 && nvs_get_i8 (nvs[s->revk], tag, data)))
               return "Cannot load number (signed)";
#ifdef	CONFIG_REVK_SETTINGS_DEBUG
            int64_t v = (int64_t) (s->size == 1 ? *((int8_t *) data) : s->size == 2 ? *((int16_t *) data) : s->size ==
                                   +4 ? *((int32_t *) data) : *((int64_t *) data));
            ESP_LOGE (TAG, "Read %s signed %lld 0x%0*llX", taga, v, s->size * 2, v);
#endif
         }
         break;
#endif
#ifdef  REVK_SETTINGS_HAS_UNSIGNED
      case REVK_SETTINGS_UNSIGNED:
         {
            data = mallocspi (len = s->size);
            if (!data)
               return "malloc";
            if ((s->size == 8 && nvs_get_u64 (nvs[s->revk], tag, data)) ||      //
                (s->size == 4 && nvs_get_u32 (nvs[s->revk], tag, data)) ||      //
                (s->size == 2 && nvs_get_u16 (nvs[s->revk], tag, data)) ||      //
                (s->size == 1 && nvs_get_u8 (nvs[s->revk], tag, data)))
            {
               if (s->gpio && s->size == 2 && !nvs_get_u8 (nvs[s->revk], tag, data))
               {                // Legacy... Old GPIO to new
                  ((uint8_t *) data)[1] = (*((uint8_t *) data) & 0xC0);
                  ((uint8_t *) data)[0] = (*((uint8_t *) data) & 0x3F);
                  return "*Migrated GPIO";
               } else
                  return "Cannot load number (unsigned)";
            }
#ifdef	CONFIG_REVK_SETTINGS_DEBUG
            uint64_t v = (uint64_t) (s->size == 1 ? *((uint8_t *) data) : s->size == 2 ? *((uint16_t *) data) : s->size ==
                                     +4 ? *((uint32_t *) data) : *((uint64_t *) data));
            ESP_LOGE (TAG, "Read %s unsigned %llu 0x%0*llX", taga, v, s->size * 2, v);
#endif
         }
         break;
#endif
#ifdef  REVK_SETTINGS_HAS_BIT
      case REVK_SETTINGS_BIT:
         {
            data = mallocspi (len = 1);
            if (nvs_get_u8 (nvs[s->revk], tag, data))
               return "Cannot load bit";
#ifdef	CONFIG_REVK_SETTINGS_DEBUG
            ESP_LOGE (TAG, "Read %s bit %d", taga, *(uint8_t *) data);
#endif
         }
         break;
#endif
#ifdef  REVK_SETTINGS_HAS_BLOB
      case REVK_SETTINGS_BLOB:
         {
            if (nvs_get_blob (nvs[s->revk], tag, NULL, &len))
               return "Cannot get blob len";
            revk_settings_blob_t *b = mallocspi (sizeof (revk_settings_blob_t) + len);
            if (!b)
               return "malloc";
            b->len = len;
            if (nvs_get_blob (nvs[s->revk], tag, b->data, &len))
               return "Cannot load blob";
#ifdef	CONFIG_REVK_SETTINGS_DEBUG
            ESP_LOGE (TAG, "Read %s blog %d", taga, b->len);
            ESP_LOG_BUFFER_HEX_LEVEL (TAG, b->data, b->len, ESP_LOG_ERROR);
#endif
            data = b;
         }
         break;
#endif
#ifdef  REVK_SETTINGS_HAS_STRING
      case REVK_SETTINGS_STRING:
         {
            if (nvs_get_str (nvs[s->revk], tag, NULL, &len))
               return "Cannot get string len";
            if (!len)
               return "Bad string len";
            data = mallocspi (len);
            if (!data)
               return "malloc";
            if (nvs_get_str (nvs[s->revk], tag, data, &len))
               return "Cannot load string";
            ((char *) data)[len - 1] = 0;       // Just in case
#ifdef	CONFIG_REVK_SETTINGS_DEBUG
            ESP_LOGE (TAG, "Read %s string %s", taga, (char *) data);
#endif
         } break;
#endif
#ifdef  REVK_SETTINGS_HAS_OCTET
      case REVK_SETTINGS_OCTET:
         {
            data = mallocspi (len = s->size);
            if (!data)
               return "malloc";
            if (nvs_get_blob (nvs[s->revk], tag, data, &len))
               return "Cannot load fixed block";
            if (len != s->size)
               return "Bad fixed block size";
#ifdef	CONFIG_REVK_SETTINGS_DEBUG
            ESP_LOGE (TAG, "Read %s fixed %d", taga, len);
            ESP_LOG_BUFFER_HEX_LEVEL (TAG, data, len, ESP_LOG_ERROR);
#endif
         }
         break;
#endif
      }
      return NULL;
   }
   const char *err = store ();
   if (err && *err != '*')
   {
      free (data);
      return err;
   }
   nvs_found[(s - revk_settings) / 8] |= (1 << ((s - revk_settings) & 7));
   if (s->malloc)
   {
      void **p = s->ptr;
      p += index;
      free (*p);
      *p = data;
   }
#ifdef  REVK_SETTINGS_HAS_BIT
   else if (s->type == REVK_SETTINGS_BIT)
   {
      if (*(uint8_t *) data)
         ((uint8_t *) & revk_settings_bits)[s->bit / 8] |= (1 << (s->bit & 7));
      else
         ((uint8_t *) & revk_settings_bits)[s->bit / 8] &= ~(1 << (s->bit & 7));
      free (data);
   }
#endif
   else
   {
      if (len > s->size)
         err = "Bad size";
      else
         memcpy (s->ptr + index * s->size, data, s->size);
      free (data);
   }
   return err;
}

#ifdef	REVK_SETTINGS_HAS_NUMERIC
static const char *
parse_numeric (revk_settings_t * s, void **pp, const char **dp, const char *e)
{                               // Single numeric parse to memory, advance memory and source
   if (!s || !dp || !pp)
      return "NULL";
   if (!s->size)
      return "Not numeric";
   const char *err = NULL;
   const char *d = *dp;
   void *p = *pp;
   while (d && d < e && *d == ' ')
      d++;
   if (!d || d >= e)
      memset (p, 0, s->size);   // Empty
   else
   {                            // Value
      uint64_t v = 0,
         f = 0;
      char sign = 0;
      int bits = s->size * 8;
      if (s->set)
         f |= (1ULL << (--bits));
      int top = bits - 1;
      const char *b = s->flags;
      void scan (void)
      {                         // Scan for flags
         while (d < e && *d != ' ' && *d != ',')
         {
            int l = 1;
            while (d + l < e && (d[l] & 0xC0) == 0x80)
               l++;
            int bit = top;
            const char *q;
            for (q = b; *q; q++)
               if (!(f & (1ULL << bit)) && !memcmp (q, d, l))   // Allows for duplicates in flags
               {
                  f |= (1ULL << bit);
                  d += l;
                  break;
               } else if (*q != ' ' && ((*q & 0xC0) != 0x80))
                  bit--;
            if (!*q)
               break;           // Not found
         }
      }
      if (b)
      {                         // Bit fields
         for (const char *q = b; *q; q++)
            if (*q != ' ' && ((*q & 0xC0) != 0x80))
               bits--;
         if (!err && bits < 0)
            err = "Too many flags";
         scan ();
      }
      // Numeric value
      int dig (int c)
      {
         if (c >= '0' && c <= '9')
            return c - '0';
         if (s->hex && ((c >= 'A' && c <= 'F') || (c >= 'a' && c <= 'f')))
            return 9 + (c & 0xF);
         return -1;
      }
      void add (char c)
      {
         uint64_t wrap = v;
         v = v * (s->hex ? 16 : 10) + dig (c);
         if (!err && v < wrap)
            err = "Number too large";
      }
      if (d < e && *d == '-')
         sign = *d++;
      if (!err && bits && (d >= e || dig (*d) < 0))
         err = "No number found";
      while (!err && d < e && dig (*d) >= 0)
         add (*d++);
      if (!err && s->decimal)
      {
         int q = s->decimal;
         if (d < e && *d == '.')
         {
            d++;
            while (!err && d < e && dig (*d) >= 0 && q && q--)
               add (*d++);
            if (!err && d < e && dig (*d) >= 0)
               err = "Too many decimal places";
         }
         while (!err && q--)
            add ('0');
      }
      if (b)
         scan ();
      if (!err && sign
#ifdef	REVK_SETTINGS_HAS_UNSIGNED
          && s->type == REVK_SETTINGS_UNSIGNED
#endif
         )
         err = "Negative not allowed";
      if (!err && bits < 64 && v >= (1ULL << bits))
         err = "Number too big";
      if (sign)
         v = -v;
      if (bits < 64)
         v = ((v & ((1ULL << bits) - 1)) | f);
      if (!err)
      {
         if (s->size == 1)
            *((uint8_t *) p) = v;
         else if (s->size == 2)
            *((uint16_t *) p) = v;
         else if (s->size == 4)
            *((uint32_t *) p) = v;
         else if (s->size == 8)
            *((uint64_t *) p) = v;
         else
            err = "Bad number size";
      }
   }

   while (d && d < e && *d == ' ' && *d != ',' && *d != '\t')
      d++;
   if (d && d < e && (*d == ',' || *d == '\t'))
      d++;
   while (d && d < e && *d == ' ')
      d++;
   p += (s->malloc ? sizeof (void *) : s->size);
   *pp = p;
   *dp = d;
   return err;
}
#endif

#ifdef	REVK_SETTINGS_HAS_NUMERIC
static char *
text_numeric (revk_settings_t * s, void *p)
{
   char *temp = mallocspi (257),
      *t = temp;
   uint64_t v = 0;
   if (s->size == 8)
      v = *((uint64_t *) p);
   else if (s->size == 4)
      v = *((uint32_t *) p);
   else if (s->size == 2)
      v = *((uint16_t *) p);
   else if (s->size == 1)
      v = *((uint8_t *) p);
   int bits = s->size * 8;
   if (!s->set || (v & (1ULL << --bits)))
   {
      const char *f = NULL;
      int bit = bits - 1;
      if (s->flags)
      {
         // Count down bits in use
         for (f = s->flags; *f; f++)
            if (*f != ' ' && ((*f & 0xC0) != 0x80))
               bits--;
         // Prefix
         for (f = s->flags; *f && *f != ' '; f++)
            if (((*f & 0xC0) != 0x80) && (v & (1ULL << (bit--))))
            {
               const char *i = f;
               *t++ = *i++;
               while ((*i & 0xC0) == 0x80)
                  *t++ = *i++;
            }
      }
      {
         uint64_t val = v;
         if (bits < 64)
            val &= ((1ULL << bits) - 1);
#ifdef	REVK_SETTINGS_HAS_SIGNED
         if (s->type == REVK_SETTINGS_SIGNED && (v & (1ULL << (bits - 1))))
         {
            *t++ = '-';
            val = -val;
            if (bits < 64)
               val |= ~((1ULL << bits) - 1);
         }
#endif
         if (bits)
         {
            if (s->decimal)
            {
               sprintf (t, "00%020llu", val);   // Extra 0s to allow space for adding .
               char *i = t,
                  *e = t + 22 - s->decimal;
               while (i < e - 1 && *i == '0')
                  i++;
               while (i < e)
                  *t++ = *i++;
               *t++ = '.';
               while (*i)
                  *t++ = *i++;
            } else if (s->hex)
               t += sprintf (t, "%llX", val);
            else
               t += sprintf (t, "%llu", val);
         }
      }
      // Suffix
      if (f && *f == ' ')
         for (f++; *f; f++)
            if (((*f & 0xC0) != 0x80) && (v & (1ULL << (bit--))))
            {
               const char *i = f;
               *t++ = *i++;
               while ((*i & 0xC0) == 0x80)
                  *t++ = *i++;
            }
   }
   *t = 0;
   return temp;
}
#endif

static int
value_cmp (revk_settings_t * s, void *a, void *b)
{                               // Pointer to actual data
   if (s->malloc)
   {
#ifdef	REVK_SETTINGS_HAS_BLOB
      if (s->type == REVK_SETTINGS_BLOB)
      {
         revk_settings_blob_t *A = *(void **) a;
         revk_settings_blob_t *B = *(void **) b;
         if (!A || !B || A->len > B->len)
            return 1;
         if (A->len < B->len)
            return -1;
         return memcmp (A->data, B->data, A->len);
      }
#endif
#ifdef	REVK_SETTINGS_HAS_STRING
      if (s->type == REVK_SETTINGS_STRING)
         return strcmp (*((char **) a), *((char **) b));
#endif
   }
   return memcmp (a, b, s->size ? : 1);
}

char *
revk_settings_text (revk_settings_t * s, int index, int *lenp)
{                               // Malloc'd string for value
   void *ptr = s->ptr;
   if (s->array)
      ptr += index * (s->malloc ? sizeof (void *) : s->size);
   if (s->malloc)
      ptr = *(void **) ptr;
   char *data = NULL;
   size_t len = 0;
   switch (s->type)
   {
#ifdef	REVK_SETTINGS_HAS_NUMERIC
#ifdef	REVK_SETTINGS_HAS_SIGNED
   case REVK_SETTINGS_SIGNED:
#endif
#ifdef	REVK_SETTINGS_HAS_UNSIGNED
   case REVK_SETTINGS_UNSIGNED:
#endif
      data = text_numeric (s, ptr);
      if (data)
         len = strlen (data);
      break;
#endif
#ifdef	REVK_SETTINGS_HAS_BIT
   case REVK_SETTINGS_BIT:
      {
         uint8_t bit = ((((uint8_t *) & revk_settings_bits)[s->bit / 8] & (1 << (s->bit & 7))) ? 1 : 0);
         data = strdup (bit ? "true" : "false");
         if (data)
            len = strlen (data);
      }
      break;
#endif
#ifdef	REVK_SETTINGS_HAS_BLOB
   case REVK_SETTINGS_BLOB:
      {
         revk_settings_blob_t *b = ptr;
         len = b->len;
         if (len)
         {
            data = mallocspi (len);
            memcpy (data, b->data, len);
         }
      }
      break;
#endif
#ifdef	REVK_SETTINGS_HAS_STRING
   case REVK_SETTINGS_STRING:
      {
         if (ptr == revk_id)
            ptr = "";           // Special case, used for hostname, see as a blank hostname
         data = strdup (ptr);
         if (data)
            len = strlen (data);
      }
      break;
#endif
#ifdef	REVK_SETTINGS_HAS_OCTET
   case REVK_SETTINGS_OCTET:
      {
         len = s->size;
         data = mallocspi (len);
         memcpy (data, ptr, len);
      }
      break;
#endif
   }
   if (len && s->secret && *revk_settings_secret)
   {
      free (data);
      data = strdup (revk_settings_secret);
      len = strlen (data);
   }
   if (lenp)
      *lenp = len;
   return data;
}

