reedy/ESP32-RevK/settings_lib.c
const char *
revk_setting (jo_t j)
{
   if (!j)
      return "";
   jo_rewind (j);
   jo_type_t t;
   if ((t = jo_here (j)) != JO_OBJECT)
      return "Not an object";
   char change = 0;
   const char *err = NULL;
   char tag[16];
   revk_setting_bits_t found = { 0 };
   const char *location = NULL;
   char *bitused = mallocspi (sizeof (revk_settings_bits));
   if (!bitused)
      return "malloc";
   memset (bitused, 0, sizeof (revk_settings_bits));
   const char *scan (int plen, int pindex)
   {
      while (!err && (t = jo_next (j)) == JO_TAG)
      {
         location = jo_debug (j);
         int l = jo_strlen (j);
         if (l + plen > sizeof (tag) - 1)
            return "Not found";
         jo_strncpy (j, tag + plen, l + 1);
         revk_settings_t *s;
         for (s = revk_settings; s->len && (s->len != plen + l || (plen && s->dot != plen) || strcmp (s->name, tag)); s++);
         const char *store (int index)
         {
            if (!s->len)
            {
               if (index < 0)
               {
                  int e = l;
                  while (e && isdigit ((int) tag[plen + e - 1]))
                     e--;
                  if (e < l)
                  {
                     for (s = revk_settings;
                          s->len && (!s->array || s->len != plen + e || (plen && s->dot != plen)
                                     || strncmp (s->name, tag, plen + e)); s++);
                     if (s)
                        index = atoi (tag + plen + e) - 1;
                  }
               }
               if (!s->len)
                  return "Not found";
            }
            if (index < 0)
               index = 0;
#ifdef	REVK_SETTINGS_HAS_BIT
            if (s->type == REVK_SETTINGS_BIT)
            {                   // De-dup bit (to allow for checkbox usage with secondary hidden)
               if (bitused[s->bit / 8] & (1 << (s->bit & 7)))
                  return NULL;  // Duplicate bit
               bitused[s->bit / 8] |= (1 << (s->bit & 7));
            }
#endif
            found[(s - revk_settings) / 8] |= (1 << ((s - revk_settings) & 7));
            if ((s->array && (index < 0 || index >= s->array)) || (!s->array && index))
               return "Bad array index";
            char *val = NULL;
            if (t == JO_NULL)
            {                   // Default
               if (s->def)
               {
                  val = (char *) s->def;
#ifdef	REVK_SETTINGS_HAS_NUMERIC
                  if (s->array && (0
#ifdef	REVK_SETTINGS_HAS_SIGNED
                                   || s->type == REVK_SETTINGS_SIGNED
#endif
#ifdef	REVK_SETTINGS_HAS_UNSIGNED
                                   || s->type == REVK_SETTINGS_UNSIGNED
#endif
                      ))
                  {             // Skip to the entry
                     if (s->dq && *val == '"')
                        val++;
                     int i = index;
                     while (i--)
                     {
                        while (*val && *val != ',' && *val != ' ' && *val != '\t')
                           val++;
                        while (*val && *val == ' ')
                           val++;
                        if (*val && (*val == ',' || *val == '\t'))
                           val++;
                        while (*val && *val == ' ')
                           val++;
                     }
                  }
#endif
                  val = strdup (val);
#ifdef	REVK_SETTINGS_HAS_NUMERIC
                  if (s->array && (1
#ifdef	REVK_SETTINGS_HAS_SIGNED
                                   || s->type == REVK_SETTINGS_SIGNED
#endif
#ifdef	REVK_SETTINGS_HAS_UNSIGNED
                                   || s->type == REVK_SETTINGS_UNSIGNED
#endif
                      ))
                  {
                     char *v = val;
                     while (*v && *v != ' ' && *v != ',' && *v != '\t' && (s->dq && *v != '"'))
                        v++;
                     *v = 0;
                  }
#endif
               }
            } else if (t != JO_CLOSE)
               val = jo_strdup (j);
            int len = s->malloc ? sizeof (void *) : s->size ? : 1;
            uint8_t *temp = mallocspi (len);
            if (!temp)
               err = "malloc";
            else
            {
               memset (temp, 0, len);
               uint8_t dofree = s->malloc;
               uint8_t bit = 0;
               void *ptr = s->ptr ? : &bit;
#ifdef	REVK_SETTINGS_HAS_BIT
               if (s->type == REVK_SETTINGS_BIT)
                  bit = ((((uint8_t *) & revk_settings_bits)[s->bit / 8] & (1 << (s->bit & 7))) ? 1 : 0);
               else
#endif
                  ptr += index * (s->malloc ? sizeof (void *) : s->size);
               if (s->secret && *revk_settings_secret && !strcmp (val, revk_settings_secret)
                   && (!s->malloc || s->type != REVK_SETTINGS_STRING || !*(char **) ptr || **((char **) ptr)))
               {                // Secret is dummy, unless current value is empty string in which case dummy value is allowed
                  free (val);
                  free (temp);
                  return NULL;
               }
               err = load_value (s, val, index, temp);
               if (!err)
               {
                  if (value_cmp (s, ptr, temp))
                  {             // Change
                     if (s->live)
                     {          // Apply live
#ifdef	REVK_SETTINGS_HAS_BIT
                        if (s->type == REVK_SETTINGS_BIT)
                        {
                           if (*temp)
                              ((uint8_t *) & revk_settings_bits)[s->bit / 8] |= (1 << (s->bit & 7));
                           else
                              ((uint8_t *) & revk_settings_bits)[s->bit / 8] &= ~(1 << (s->bit & 7));
                        } else
#endif
                        {
                           if (s->malloc)
                              free (*(void **) ptr);
                           memcpy (ptr, temp, len);
                           dofree = 0;
                        }
                     }
                     if (t == JO_NULL && !s->fix)
                        err = nvs_erase (s, s->name);
                     else
                        err = nvs_put (s, index, temp);
                     if (!err && !s->live)
                     {
#ifdef  CONFIG_REVK_SETTINGS_DEBUG
                        ESP_LOGE (TAG, "Changed %s[%d]", s->name, index);
#endif
                        change = 1;
                     }
                  } else if (t == JO_NULL && !s->fix)
                     err = nvs_erase (s, s->name);
               }
               if (dofree)
                  free (*(void **) temp);
               free (temp);
            }
            free (val);
            return err;
         }
         t = jo_next (j);
         if (*tag == '_')
            continue;           // Not a real setting
         void zapdef (void)
         {
            if (pindex >= 0)
               err = store (pindex);
            else if (s->array)
               for (int i = 0; !err && i < s->array; i++)
                  err = store (i);
            else
               err = store (-1);
         }
         if (t == JO_NULL)
         {
            if (s->len)
               zapdef ();
            else if (!plen)
            {
               for (s = revk_settings; s->len && (!s->group || s->dot != l || strncmp (s->name, tag, l)); s++);
               if (s->len)
               {                // object reset
                  int group = s->group;
                  for (s = revk_settings; s->len; s++)
                     if (s->group == group)
                        zapdef ();      // Including secrets
               }
            } else
               return "Invalid null";
         } else if (t == JO_OBJECT)
         {                      // Object
            if (plen)
               return "Nested too far";
            if (s->len)
               return "Not an object";
            for (s = revk_settings; s->len && (!s->group || s->dot != l || strncmp (s->name, tag, l)); s++);
            if (!s->len)
               err = "Unknown object";
            else
            {
               int group = s->group;
               err = scan (l, -1);
               if (err)
                  return err;
               t = JO_NULL;     // Set to default
               for (s = revk_settings; s->len; s++)
                  if (s->group == group && !(found[(s - revk_settings) / 8] & (1 << ((s - revk_settings) & 7))) && !s->secret)
                     zapdef (); // Not secrets, D'Oh
            }
         } else if (t == JO_ARRAY)
         {                      // Array
            if (pindex >= 0)
               return "Unexpected array";
            if (!s->len)
            {
               for (s = revk_settings; s->len && (!s->group || s->dot != l || strncmp (s->name, tag, l)); s++);
               if (!s->len)
                  return "Not found";
               int group = s->group;
               int index = 0;
               while ((t = jo_next (j)) != JO_CLOSE && index < s->array)
               {
                  for (s = revk_settings; s->len && (!s->group || s->dot != l || strncmp (s->name, tag, l)); s++);
                  if (!s->len)
                     return "Unknown object";
                  if ((err = scan (l, index)))
                     return err;
                  index++;
               }
               while (1)
               {                // Clean up
                  for (s = revk_settings; s->len && (s->group != group || s->array <= index); s++);
                  if (!s->len)
                     break;
                  for (s = revk_settings; s->len; s++)
                     if (s->group == group && s->array >= index)
                        if ((err = store (index)))
                           return err;
                  index++;
               }
               t = JO_NULL;     // Set to default
               for (s = revk_settings; s->len; s++)
                  if (s->group == group && !(found[(s - revk_settings) / 8] & (1 << ((s - revk_settings) & 7))) && !s->secret)
                     zapdef (); // Not secrets, D'Oh
            } else if (!s->array)
               return "Unexpected array";
            else
            {
               int index = 0;
               while (!err && (t = jo_next (j)) != JO_CLOSE && index < s->array)
               {
                  if ((err = store (index)))
                     return err;
                  index++;
               }
               while (!err && index < s->array)
               {                // NULLs
                  if ((err = store (index)))
                     return err;
                  index++;
               }
            }
         } else if ((err = store (pindex)))
            return err;
      }
      return err;
   }
   err = scan (0, -1);
   if (err)
   {
      ESP_LOGE (TAG, "Failed %s at [%s]", err, location ? : "?");
      jo_t e = jo_make (NULL);
      jo_string (e, "error", err);
      jo_string (e, "location", location);
      revk_error (prefixsetting, &e);
   }
   if (change)
      revk_restart ("Settings changed", 5);
   return err ? : "";
}

void
revk_settings_commit (void)
{
#ifdef  CONFIG_REVK_SETTINGS_DEBUG
   ESP_LOGE (TAG, "NVC commit");
#endif
   REVK_ERR_CHECK (nvs_commit (nvs[0]));
   REVK_ERR_CHECK (nvs_commit (nvs[1]));
}

revk_settings_t *
revk_settings_find (const char *tag, int *indexp)
{
   revk_settings_t *s = NULL;
   int index = 0;
   if (tag && *tag)
   {
      int l = strlen (tag);
      for (s = revk_settings; s->len && (s->len != l || strcmp (s->name, tag)); s++);
      if (!s->len)
      {
         int e = l;
         while (e && isdigit ((int) tag[e - 1]))
            e--;
         if (e < l)
         {
            for (s = revk_settings; s->len && (!s->array || s->len != e || strncmp (s->name, tag, e)); s++);
            if (!s->len)
               return NULL;
            index = atoi (tag + e) - 1;
            if (index < 0 || index >= s->array)
               return NULL;
         }
      }
   }
   if (indexp)
      *indexp = index;
   return s;
}

#endif
